IDEA Open Model
BeamDataEc2.TypeOfSupportRight Property
Compatible with IDEA StatiCa 20.1
 Type of support on the right side
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public TypeOfSupportConditions TypeOfSupportRight { get; set; }
Public Property TypeOfSupportRight As TypeOfSupportConditions
	Get
	Set
Property Value
Type: TypeOfSupportConditions
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace